# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'ack'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'composer'
brew 'doctl'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu'
brew 'pkg-config'
brew 'svn'
brew 'wget'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'

# Spatie Media Library
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mariadb'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'ghostscript'

# Apps
cask 'alfred'
cask 'babeledit' # Language file editor
cask 'bartender'
cask 'caffeine'
cask 'daisydisk'
cask 'firefox'
cask 'google-chrome'
cask 'google-backup-and-sync'
# cask 'gpg-suite' # Not supported on Big Sur yet
cask 'iterm2'
cask 'phpstorm'
cask 'datagrip'
cask 'spotify'
cask 'tinkerwell'
cask 'transmit'

# Quicklook
cask 'qlcolorcode' # syntax highlighting
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen' # plain text files without a file extension
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'HP Smart', id: 1474276998
mas 'LastPass', id: 926036361
mas 'Messenger', id: 1480068668
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'PDF Reader', id: 1185380569
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
