# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask' # PHP monitor
tap 'stripe/stripe-cli'

# Binaries
brew 'ack'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu'
brew 'pkg-config'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'wget'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'

# Spatie Media Library
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'ghostscript'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'adguard'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'babeledit' # Language file editor
cask 'backblaze' # cloud backups
cask 'bartender'
cask 'daisydisk'
cask 'firefox'
cask 'google-chat'
cask 'google-chrome'
cask 'helo'
cask 'iterm2'
cask 'logitech-options'
cask 'nordvpn'
cask 'phpmon'
cask 'phpstorm'
cask 'ray' # spatie debug tool
cask 'responsively' # Responsive dev app
cask 'spotify'
cask 'tableplus' # database gui
cask 'tinkerwell'
cask 'transmit'
cask 'zoom'

# Quicklook
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Amphetamine', id: 937984704 # Prevent display from sleeping
mas 'ColorSlurp', id: 1287239339 # Color picker
mas 'HP Smart', id: 1474276998
mas 'Messenger', id: 1480068668
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'Petrify', id: 1451177988 # Code screenshot tool
mas 'Spark', id: 1176895641 # Desktop email gui
mas 'The Unarchiver', id: 425424353
